# Psi Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Psi Property
SymbolTypeId Class See Also
---
Symbol psi, indicating unit Pounds force per square inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Psi { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Psi As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Psi {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace